#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-6ehxQFz6i1nZXPUL" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/6b0e4f5f-a13b-479a-97cb-e6fb7cfee90b/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-6ehxQFz6i1nZXPUL

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...
github_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]
github_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314: Refreshing state... [id=cdktf-provider-launchdarkly]
github_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B: Refreshing state... [id=cdktf-provider-launchdarkly-go]
github_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]
github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]
github_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_PASSWORD]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4: Refreshing state... [id=cdktf-provider-launchdarkly:NPM_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_USERNAME]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160: Refreshing state... [id=cdktf-provider-launchdarkly:GO_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_PASSWORD]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8: Refreshing state... [id=cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B: Refreshing state... [id=cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD: Refreshing state... [id=cdktf-provider-launchdarkly:NUGET_API_KEY]
github_repository_webhook.repospartners_cdktfproviderlaunchdarkly_repositorysetup_slackwebhook_9AD3D6AF: Refreshing state... [id=425871226]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_USERNAME]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5: Refreshing state... [id=cdktf-provider-launchdarkly:GH_TOKEN]
github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D: Refreshing state... [id=cdktf-provider-launchdarkly:automerge]
github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB: Refreshing state... [id=BPR_kwDOJ_5BQc4CYBOl]
data.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 4s [id=6602018]
github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B: Refreshing state... [id=cdktf-provider-launchdarkly-go:automerge]
github_repository_webhook.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_slackwebhook_E7459C6F: Refreshing state... [id=425871230]
github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]
github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]
github_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]
github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]
github_team_repository.repospartners_cdktfproviderlaunchdarkly_repositorysetup_managingteam_B55490C8: Refreshing state... [id=6602018:cdktf-provider-launchdarkly]
github_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]
github_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]
github_team_repository.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_managingteam_7D3BC365: Refreshing state... [id=6602018:cdktf-provider-launchdarkly-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtoken_6F139405 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtoken_6F139405" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80 will be created
  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D will be created
  + resource "github_branch_protection" "repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = true
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = "cdktf-provider-oci"
      + require_signed_commits = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_issue_label.repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62 will be created
  + resource "github_issue_label" "repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-oci"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9 will be created
  + resource "github_issue_label" "repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-oci-go"
      + url        = (known after apply)
    }

  # github_repository.repospartners_cdktfprovideroci_repo_C384C123 will be created
  + resource "github_repository" "repospartners_cdktfprovideroci_repo_C384C123" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Prebuilt Terraform CDK (cdktf) provider for oci."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-oci"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "oci",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository.repospartners_cdktfproviderocigo_repo_B84D5DC7 will be created
  + resource "github_repository" "repospartners_cdktfproviderocigo_repo_B84D5DC7" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = true
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "CDK for Terraform Go provider bindings for oci."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.tf"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cdktf-provider-oci-go"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "cdk",
          + "cdktf",
          + "oci",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility             = "public"
    }

  # github_repository_webhook.repospartners_cdktfprovideroci_repositorysetup_slackwebhook_3D0B810A will be created
  + resource "github_repository_webhook" "repospartners_cdktfprovideroci_repositorysetup_slackwebhook_3D0B810A" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-oci"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.repospartners_cdktfproviderocigo_repositorysetup_slackwebhook_23C164C0 will be created
  + resource "github_repository_webhook" "repospartners_cdktfproviderocigo_repositorysetup_slackwebhook_23C164C0" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktf-provider-oci-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.repospartners_cdktfprovideroci_repositorysetup_managingteam_EFD5E668 will be created
  + resource "github_team_repository" "repospartners_cdktfprovideroci_repositorysetup_managingteam_EFD5E668" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-oci"
      + team_id    = "6602018"
    }

  # github_team_repository.repospartners_cdktfproviderocigo_repositorysetup_managingteam_D277AE51 will be created
  + resource "github_team_repository" "repospartners_cdktfproviderocigo_repositorysetup_managingteam_D277AE51" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktf-provider-oci-go"
      + team_id    = "6602018"
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repospartners_providerRepos_017B2065 = [
        # (1 unchanged element hidden)
        "git@github.com:cdktf/cdktf-provider-mongodbatlas.git",
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: Running plan in the remote backend. Output will stream here. Pressing Ctrl-C%0Awill stop streaming the logs, but will not stop the plan running remotely.%0A%0APreparing the remote plan...%0A%0ATo view this run in a browser, visit:%0Ahttps://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-6ehxQFz6i1nZXPUL%0A%0AWaiting for the plan to start...%0A%0ATerraform v1.3.7%0Aon linux_amd64%0AInitializing plugins and modules...%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Reading...%0Agithub_repository.repospartners_cdktfprovidermongodbatlasgo_repo_718CC063: Refreshing state... [id=cdktf-provider-mongodbatlas-go]%0Agithub_repository.repospartners_cdktfproviderlaunchdarkly_repo_AF3BB314: Refreshing state... [id=cdktf-provider-launchdarkly]%0Agithub_repository.repospartners_cdktfproviderlaunchdarklygo_repo_C9F0819B: Refreshing state... [id=cdktf-provider-launchdarkly-go]%0Agithub_repository.repospartners_cdktfprovidermongodbatlas_repo_B439CDB5: Refreshing state... [id=cdktf-provider-mongodbatlas]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_slackwebhook_18FFF8DE: Refreshing state... [id=398580580]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4: Refreshing state... [id=cdktf-provider-launchdarkly:NPM_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_USERNAME]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160: Refreshing state... [id=cdktf-provider-launchdarkly:GO_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8: Refreshing state... [id=cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B: Refreshing state... [id=cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD: Refreshing state... [id=cdktf-provider-launchdarkly:NUGET_API_KEY]%0Agithub_repository_webhook.repospartners_cdktfproviderlaunchdarkly_repositorysetup_slackwebhook_9AD3D6AF: Refreshing state... [id=425871226]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_USERNAME]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]%0Agithub_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5: Refreshing state... [id=cdktf-provider-launchdarkly:GH_TOKEN]%0Agithub_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D: Refreshing state... [id=cdktf-provider-launchdarkly:automerge]%0Agithub_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB: Refreshing state... [id=BPR_kwDOJ_5BQc4CYBOl]%0Adata.github_team.repospartners_cdktfteamcdktf_13186D35: Read complete after 4s [id=6602018]%0Agithub_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B: Refreshing state... [id=cdktf-provider-launchdarkly-go:automerge]%0Agithub_repository_webhook.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_slackwebhook_E7459C6F: Refreshing state... [id=425871230]%0Agithub_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]%0Agithub_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]%0Agithub_repository_webhook.repospartners_cdktfprovidermongodbatlas_repositorysetup_slackwebhook_9D8453CA: Refreshing state... [id=398580582]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]%0Agithub_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]%0Agithub_team_repository.repospartners_cdktfproviderlaunchdarkly_repositorysetup_managingteam_B55490C8: Refreshing state... [id=6602018:cdktf-provider-launchdarkly]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_managingteam_24105904: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]%0Agithub_team_repository.repospartners_cdktfprovidermongodbatlas_repositorysetup_managingteam_0804D53A: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]%0Agithub_team_repository.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_managingteam_7D3BC365: Refreshing state... [id=6602018:cdktf-provider-launchdarkly-go]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtoken_6F139405 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtoken_6F139405" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "GH_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "GO_GITHUB_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "PROJEN_GITHUB_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "MAVEN_PASSWORD"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "MAVEN_STAGING_PROFILE_ID"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "MAVEN_USERNAME"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "NPM_TOKEN"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "NUGET_API_KEY"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "TWINE_PASSWORD"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80 will be created%0A  + resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80" {%0A      + created_at      = (known after apply)%0A      + id              = (known after apply)%0A      + plaintext_value = (sensitive value)%0A      + repository      = "cdktf-provider-oci"%0A      + secret_name     = "TWINE_USERNAME"%0A      + updated_at      = (known after apply)%0A    }%0A%0A  # github_branch_protection.repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D will be created%0A  + resource "github_branch_protection" "repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D" {%0A      + allows_deletions       = false%0A      + allows_force_pushes    = false%0A      + enforce_admins         = true%0A      + id                     = (known after apply)%0A      + pattern                = "main"%0A      + repository_id          = "cdktf-provider-oci"%0A      + require_signed_commits = false%0A%0A      + required_status_checks {%0A          + contexts = [%0A              + "Validate PR title",%0A              + "build",%0A              + "package-dotnet",%0A              + "package-go",%0A              + "package-java",%0A              + "package-js",%0A              + "package-python",%0A            ]%0A          + strict   = true%0A        }%0A    }%0A%0A  # github_issue_label.repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62 will be created%0A  + resource "github_issue_label" "repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62" {%0A      + color      = "5DC8DB"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "automerge"%0A      + repository = "cdktf-provider-oci"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_issue_label.repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9 will be created%0A  + resource "github_issue_label" "repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9" {%0A      + color      = "5DC8DB"%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + name       = "automerge"%0A      + repository = "cdktf-provider-oci-go"%0A      + url        = (known after apply)%0A    }%0A%0A  # github_repository.repospartners_cdktfprovideroci_repo_C384C123 will be created%0A  + resource "github_repository" "repospartners_cdktfprovideroci_repo_C384C123" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + auto_init              = true%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = true%0A      + description            = "Prebuilt Terraform CDK (cdktf) provider for oci."%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = true%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://cdk.tf"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "cdktf-provider-oci"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + topics                 = [%0A          + "cdk",%0A          + "cdktf",%0A          + "oci",%0A          + "pre-built-provider",%0A          + "provider",%0A          + "terraform",%0A          + "terraform-cdk",%0A        ]%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository.repospartners_cdktfproviderocigo_repo_B84D5DC7 will be created%0A  + resource "github_repository" "repospartners_cdktfproviderocigo_repo_B84D5DC7" {%0A      + allow_merge_commit     = true%0A      + allow_rebase_merge     = true%0A      + allow_squash_merge     = true%0A      + archived               = false%0A      + auto_init              = true%0A      + default_branch         = (known after apply)%0A      + delete_branch_on_merge = true%0A      + description            = "CDK for Terraform Go provider bindings for oci."%0A      + etag                   = (known after apply)%0A      + full_name              = (known after apply)%0A      + git_clone_url          = (known after apply)%0A      + has_issues             = false%0A      + has_projects           = false%0A      + has_wiki               = false%0A      + homepage_url           = "https://cdk.tf"%0A      + html_url               = (known after apply)%0A      + http_clone_url         = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "cdktf-provider-oci-go"%0A      + node_id                = (known after apply)%0A      + private                = (known after apply)%0A      + repo_id                = (known after apply)%0A      + ssh_clone_url          = (known after apply)%0A      + svn_url                = (known after apply)%0A      + topics                 = [%0A          + "cdk",%0A          + "cdktf",%0A          + "oci",%0A          + "pre-built-provider",%0A          + "provider",%0A          + "terraform",%0A          + "terraform-cdk",%0A        ]%0A      + visibility             = "public"%0A    }%0A%0A  # github_repository_webhook.repospartners_cdktfprovideroci_repositorysetup_slackwebhook_3D0B810A will be created%0A  + resource "github_repository_webhook" "repospartners_cdktfprovideroci_repositorysetup_slackwebhook_3D0B810A" {%0A      + active     = true%0A      + etag       = (known after apply)%0A      + events     = [%0A          + "issues",%0A        ]%0A      + id         = (known after apply)%0A      + repository = "cdktf-provider-oci"%0A      + url        = (known after apply)%0A%0A      + configuration {%0A          + content_type = "json"%0A          + url          = (sensitive value)%0A        }%0A    }%0A%0A  # github_repository_webhook.repospartners_cdktfproviderocigo_repositorysetup_slackwebhook_23C164C0 will be created%0A  + resource "github_repository_webhook" "repospartners_cdktfproviderocigo_repositorysetup_slackwebhook_23C164C0" {%0A      + active     = true%0A      + etag       = (known after apply)%0A      + events     = [%0A          + "issues",%0A        ]%0A      + id         = (known after apply)%0A      + repository = "cdktf-provider-oci-go"%0A      + url        = (known after apply)%0A%0A      + configuration {%0A          + content_type = "json"%0A          + url          = (sensitive value)%0A        }%0A    }%0A%0A  # github_team_repository.repospartners_cdktfprovideroci_repositorysetup_managingteam_EFD5E668 will be created%0A  + resource "github_team_repository" "repospartners_cdktfprovideroci_repositorysetup_managingteam_EFD5E668" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "admin"%0A      + repository = "cdktf-provider-oci"%0A      + team_id    = "6602018"%0A    }%0A%0A  # github_team_repository.repospartners_cdktfproviderocigo_repositorysetup_managingteam_D277AE51 will be created%0A  + resource "github_team_repository" "repospartners_cdktfproviderocigo_repositorysetup_managingteam_D277AE51" {%0A      + etag       = (known after apply)%0A      + id         = (known after apply)%0A      + permission = "admin"%0A      + repository = "cdktf-provider-oci-go"%0A      + team_id    = "6602018"%0A    }%0A%0APlan: 22 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ repospartners_providerRepos_017B2065 = [%0A        # (1 unchanged element hidden)%0A        "git@github.com:cdktf/cdktf-provider-mongodbatlas.git",%0A      + (known after apply),%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*